{
  "summary": {
    "title": "Summary",
    "description": "Fast learner and self-taught software engineer with"
  },
  "workExperience": {
    "title": "Work Experience",
    "suger": {
      "title": "Suger - Software Engineer (Oct. 2024 - Jul. 2025)",
      "achievements": [
        "Planned and delivered features end-to-end: task planning, APIs and UIs, database changes, cloud connections, tests and documentation.",
        "Built and incremented reusable API integrations for Salesforce, HubSpot, NetSuite, Quickbooks, among others, so integrations were easier to build and customize.",
        "Ran ten technical interviews: made and reviewed interview projects, interviewed candidates, wrote evaluations and participated in the hiring decision.",
        "Onboarded and mentored three engineers: discussed and clarified tasks and bugs, paired on code and reviewed pull requests to help them start contributing faster. Worked leading these engineers on the development of larger features from design to deployment."
      ],
      "skills": [
        "Typescript",
        "Vue",
        "Javascript",
        "HTML",
        "Tailwind CSS",
        "CSS",
        "Jest",
        "Playwright",
        "Golang",
        "Postgres",
        "AWS",
        "n8n"
      ]
    },
    "radixDeveloperIV": {
      "title": "Radix Engineering and Software - Developer IV (Sep. 2024 - Oct. 2024)",
      "achievements": [
        "Optimized performance and usability of a Dashboard displaying industrial data with multiple charts containing hundreds of thousands of points each and a Web GL 3D view, using strategies like caching and lazy loading to bring memory consumption to a third of its value; request splitting and geometry filters to reduce request duration up to 95%; and pre-fetching to reduce feature loading from more than 10s to a fraction of a second."
      ],
      "skills": ["Typescript", "Next JS", "React", "Javascript", "Tailwind CSS", "CSS", "HTML", "GraphQL", "ThreeJS"]
    },
    "radixDeveloperIII": {
      "title": "Radix Engineering and Software - Developer III (Aug. 2023 - Sep. 2024)",
      "achievements": [
        "Led the implementation of a new interactive 3D visualization of an oil refinery plant for increased data contextualization, having left stakeholders impressed by the MVP and wanting to expand its features.",
        "Led a team of four developers, providing tailored feedback to enhance performance, aiding in comprehension of requirements and their implications, workflow organization, and continuous testing. Helped team members to achieve an estimated 50% to 100% increase in productivity, measured by reduced time for delivering user stories."
      ],
      "skills": ["Typescript", "React", "Javascript", "Tailwind CSS", "CSS", "HTML", "ThreeJS", "C#", ".NET", "MS SQL"]
    },
    "radixDeveloperII": {
      "title": "Radix Engineering and Software - Developer II (Aug. 2022 - Aug. 2023)",
      "achievements": [
        "Reduced deployment time by 80% by creating deployment pipelines, reducing it from 20 minutes to 4 minutes on average on multiple on-premises virtual machines, thus enabling faster testing cycles and eliminating deployment errors.",
        "Saved an estimated amount of 200 hours in development time by reimplementing an Excel-like spreadsheet solution with a more feature-rich and compatible library.",
        "Consistently delivered user stories within 40% to 70% of allocated timeframes."
      ],
      "skills": ["Typescript", "React", "Javascript", "CSS", "HTML", "Redux", "C#", ".NET", "MS SQL", "Azure DevOps"]
    },
    "radixIntern": {
      "title": "Radix Engineering and Software - Software Development Intern (May 2021 - Aug. 2022)",
      "achievements": [
        "Learned web development technologies from scratch during the internship, earning recognition for resolving issues and bugs swiftly. Completed the internship six months ahead of schedule, securing a full-time position as Developer II, bypassing the typical entry-level position of Developer I."
      ],
      "skills": [
        "Typescript",
        "Angular",
        "Javascript",
        "CSS",
        "SCSS",
        "HTML",
        "RxJS",
        "C#",
        ".NET",
        "MS SQL",
        "Postgres"
      ]
    }
  },
  "education": {
    "title": "Education",
    "ufrj": {
      "title": "Federal University of Rio de Janeiro - BSc of Chemical Engineering (Mar 2017- Sep. 2022)",
      "achievements": [
        "Created an algorithm for rare-earth elements separation process simulation and optimization which more than halved experimental time effort, found optimal conditions one-fifth of the cost of previous ones, and reduced project complexity through variables importance ranking and elimination. Received two awards for best undergraduate research, in 2020 and 2021, by the research facility where they were carried. Here you can find the source code."
      ],
      "skills": ["Python", "Chemical Engineering", "Numerical Analysis", "Process Optimization"]
    }
  },
  "certifications": {
    "title": "Certifications",
    "azure": "Microsoft Certified Azure Associate Developer"
  },
  "languages": {
    "title": "Languages",
    "portuguese": "Portuguese: Native",
    "english": "English: Proficient (IELTS Band 8.5 | CEFR C2 equivalent, credential",
    "englishCredential": "23BR000122BATJ705G",
    "french": "French: Advanced (CEFR C1, CREDENTIAL ID: 8D2CAB511C9D)"
  }
}
